# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [1]:
#Write your code here
import pandas as pd
df1 = pd.read_csv('data/Purchase_Data.csv')
df1.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [2]:
#Write your code here
df1.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [3]:
#Write you code here
result_1 = df1.loc[:,['invoice_number', 'invoice_time']]
result_1.head()

   invoice_number   invoice_time
0    2.020000e+11  7/15/15 10:45
1    2.020000e+11  7/15/15 12:16
2    2.020000e+11  7/15/15 12:16
3    2.020000e+11  7/15/15 12:16
4    2.020000e+11  7/15/15 12:16

Slice the first two rows using .loc and store the result in a variable called result_2.

In [4]:
#Write you code here
result_2 = df1.loc[[0, 1], :]
result_2.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [5]:
#Write your code here
result_3 = df1.iloc[0:5, 0:6]
result_3.head(10)

   invoice_number   invoice_time store_id  product_id  category_id  num_item
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101       1.0
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203       1.0
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203       1.0
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401       1.0
4    2.020000e+11  7/15/15 12:16     G816     7090363        70401       1.0

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [6]:
#Write your code here
# using iloc: result_4 = df1.iloc[[0, 4, 6], [1, 6]]
# or alternatively using loc
result_4 = df1.loc[[0, 4, 6], ['invoice_time', 'price']]
result_4.head(10)

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [7]:
num_rows = df1.shape[0]
num_rows

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [8]:
print(df1.iloc[num_rows-1, :])
df1.iloc[num_rows-1, :]

invoice_number    202000000000.0
invoice_time        9/5/15 23:38
store_id                    G619
product_id              23030206
category_id               210101
num_item                     1.0
price                        2.0
Name: 5381, dtype: object

invoice_number    202000000000.0
invoice_time        9/5/15 23:38
store_id                    G619
product_id              23030206
category_id               210101
num_item                     1.0
price                        2.0
Name: 5381, dtype: object

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [9]:
#Write your code here
avg_price = df1['price'].mean()
max_price = df1['price'].max()
print(f"Average = {avg_price}\nMaximum = {max_price}")
df1.describe()

Average = 3.1920522110741363
Maximum = 6.01

       invoice_number    product_id    category_id     num_item        price
count    5.382000e+03  5.382000e+03    5382.000000  5382.000000  5382.000000
mean     2.020000e+11  8.740911e+06  115465.616499     1.298309     3.192052
std      0.000000e+00  5.048294e+06   65448.435316     2.168725     1.652007
min      2.020000e+11  7.000034e+06   70101.000000     0.500000     0.000000
25%      2.020000e+11  7.070884e+06   70201.000000     1.000000     2.000000
50%      2.020000e+11  7.071096e+06   70401.000000     1.000000     2.500000
75%      2.020000e+11  7.090592e+06  210101.000000     1.000000     5.000000
max      2.020000e+11  3.000077e+07  210301.000000   116.000000     6.010000

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [10]:
#Write you code here
avg_price, avg_num_items = df1[['price', 'num_item']].mean()
print(f"Average Number = {avg_price}\nAverage Number of Items Purchased = {avg_num_items}")

Average Number = 3.1920522110741363
Average Number of Items Purchased = 1.2983091787439613

Create a column called "total", which is the product of the price and num_item columns.

In [11]:
#Write your code here
df1['total'] = df1['price'] * df1['num_item']
df1[['total']]

      total
0       2.0
1       2.0
2       2.0
3       6.0
4       6.0
...     ...
5377    3.0
5378    6.0
5379    5.0
5380    4.0
5381    2.0

[5382 rows x 1 columns]

What is the avgerage price of the three most expensive purchases?

In [12]:
#Write your code here
float(df1['price'].nlargest(n=3).mean())

6.003333333333333

How many different products are there?

In [13]:
#Write your code here
df1['product_id'].nunique()

53

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [14]:
float(df1.describe().loc['mean','total'] - df1.describe().loc['50%','total'])

0.9318078781127839

Use the drop() method to delete the column total from the dataframe df_data.

In [15]:
df1.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,6.0

In [16]:
#Write your code here
df1.drop(columns=['total'], inplace=True)
df1.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Let's dig a little deeper into the data set and answer some basic question.

In [17]:
#Write your code here
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5382 entries, 0 to 5381
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_number  5382 non-null   float64
 1   invoice_time    5382 non-null   object
 2   store_id        5382 non-null   object
 3   product_id      5382 non-null   int64
 4   category_id     5382 non-null   int64
 5   num_item        5382 non-null   float64
 6   price           5382 non-null   float64
dtypes: float64(3), int64(2), object(2)
memory usage: 294.5+ KB

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [18]:
df1['invoice_time'] = pd.to_datetime(df1['invoice_time'])
df1['invoice_time'].info()

C:\Users\Khalid\AppData\Local\Temp\ipykernel_43988\463253556.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df1['invoice_time'] = pd.to_datetime(df1['invoice_time'])

<class 'pandas.core.series.Series'>
RangeIndex: 5382 entries, 0 to 5381
Series name: invoice_time
Non-Null Count  Dtype
--------------  -----
5382 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 42.2 KB

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [19]:
df1['DOW'] = df1['invoice_time'].dt.day_name()
df1['Month'] = df1['invoice_time'].dt.month
df1.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,DOW,Month
0,2.020000e+11,2015-07-15 10:45:00,G816,7000300,210101,1.0,2.0,Wednesday,7
1,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,7
2,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,7
3,2.020000e+11,2015-07-15 12:16:00,G816,7070891,70401,1.0,6.0,Wednesday,7
4,2.020000e+11,2015-07-15 12:16:00,G816,7090363,70401,1.0,6.0,Wednesday,7

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [20]:
num_purchases_wed1 = df1['DOW'].value_counts()['Wednesday']
float(num_purchases_wed1)

959.0

In [21]:
num_purchases_wed2 = (df1['DOW'] == 'Wednesday').sum()
float(num_purchases_wed2)

959.0

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [22]:
#Write your code here
df2 = pd.read_csv('data/Titanic.csv')
df2.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [23]:
#Write your code here
df2 = df2.rename(columns={'Name':'Passenger_Name', 'Ticket':'Ticket_Num'})
df2.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Change the index of the df_titanic to the column PasengerID.

In [24]:
#Write your code here
df2.set_index('PassengerId',inplace=True)
df2.head()

,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Select the name of passenger 896

In [25]:
df2.loc[896,'Passenger_Name']

'Hirvonen, Mrs. Alexander (Helga E Lindqvist)'

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [32]:
df2.reset_index(drop=False, inplace=True)
df2.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [34]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   PassengerId     418 non-null    int64
 1   Pclass          418 non-null    int64
 2   Passenger_Name  418 non-null    object
 3   Sex             418 non-null    object
 4   Age             332 non-null    float64
 5   SibSp           418 non-null    int64
 6   Parch           418 non-null    int64
 7   Ticket_Num      418 non-null    object
 8   Fare            417 non-null    float64
 9   Cabin           91 non-null     object
 10  Embarked        418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.1+ KB

In [33]:
df2['Age'].isnull().sum()

np.int64(86)

Compute the avg age of passengers ignoring the missing data.

In [35]:
df2['Age'].mean()

np.float64(30.272590361445783)

Using the fillna() method replace the missing values in the Age column with the mean.

In [37]:
df2['Age'].fillna(df2['Age'].mean(), inplace=True)
df2.head()

C:\Users\Khalid\AppData\Local\Temp\ipykernel_43988\1592073376.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2['Age'].fillna(df2['Age'].mean(), inplace=True)

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [39]:
df2['Age'].isnull().sum()

np.int64(0)

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [40]:
df2['Age'].nlargest(5).mean()

np.float64(67.0)